0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ground
    {
        type            calculated;
        value           nonuniform List<scalar> 
5358
(
41887.1
41887.2
41887.3
41887.4
41887.5
41887.6
41887.8
41887.9
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
    }
    buildings
    {
        type            calculated;
        value           nonuniform List<scalar> 
176554
(
9271.8
6553.33
6568.18
6843.33
6843.71
6846.19
6844.04
6839.73
...
)
;
    }
}


// ************************************************************************* //
